In [1]:
acteurs=[{'acteur':'dwayne johnson', 'revenu':899.4 ,'films':['santa','oceanne','folere','kossam']},
        {'acteur':'christ hemswort', 'revenu':769.4 , 'films':['amour','histoire','elisa','diego']}, 
        {'acteur':' ROBERT jR', 'revenu':669 ,'films':['iroman','le justicier','folere','kossam']},
        {'acteur':'kUMAR', 'revenu':65,'films':['KESARI','oSARIeanne','folere','kossam']},                                    
        {'acteur':' jackie chann', 'revenu':588 ,'films':[ 'le maitre chinois', 'police story','karaté kids']},                                                  
       ]
acteurs

[{'acteur': 'dwayne johnson',
  'revenu': 899.4,
  'films': ['santa', 'oceanne', 'folere', 'kossam']},
 {'acteur': 'christ hemswort',
  'revenu': 769.4,
  'films': ['amour', 'histoire', 'elisa', 'diego']},
 {'acteur': ' ROBERT jR',
  'revenu': 669,
  'films': ['iroman', 'le justicier', 'folere', 'kossam']},
 {'acteur': 'kUMAR',
  'revenu': 65,
  'films': ['KESARI', 'oSARIeanne', 'folere', 'kossam']},
 {'acteur': ' jackie chann',
  'revenu': 588,
  'films': ['le maitre chinois', 'police story', 'karaté kids']}]

In [2]:
revenus= []
for acteur in acteurs:
    r= acteur['revenu']
    revenus.append(r)
revenus

[899.4, 769.4, 669, 65, 588]

In [3]:
import statistics as st

revenu_moyen= st.mean(revenus)
revenu_moyen

598.16

In [4]:
for acteur in acteurs:
    if acteur['revenu'] > revenu_moyen:
         print(acteur )

{'acteur': 'dwayne johnson', 'revenu': 899.4, 'films': ['santa', 'oceanne', 'folere', 'kossam']}
{'acteur': 'christ hemswort', 'revenu': 769.4, 'films': ['amour', 'histoire', 'elisa', 'diego']}
{'acteur': ' ROBERT jR', 'revenu': 669, 'films': ['iroman', 'le justicier', 'folere', 'kossam']}

COURS DATAFRAME

In [5]:
Notes = {'Ryan':[18,16], 
         'Elisa':[20,12], 
         'Marthe':[20,20],
         'Robert':[14,15]}
Notes

{'Ryan': [18, 16], 'Elisa': [20, 12], 'Marthe': [20, 20], 'Robert': [14, 15]}

In [6]:
import pandas as pd
df= pd.DataFrame(Notes)
df

   Ryan  Elisa  Marthe  Robert
0    18     20      20      14
1    16     12      20      15

In [7]:
df=df.T
df

         0   1
Ryan    18  16
Elisa   20  12
Marthe  20  20
Robert  14  15

In [9]:
df.columns= ['Maths' , 'Francais']
df

        Maths  Francais
Ryan       18        16
Elisa      20        12
Marthe     20        20
Robert     14        15

In [10]:
df.index

Index(['Ryan', 'Elisa', 'Marthe', 'Robert'], dtype='object')